import { Box, Card } from '@mui/material'
import React from 'react'
import Heart from '../../Animation/Heart/Heart'
import LayeredText from '../../Animation/LayeredText/LayeredText'
import Calculator from './Calculator'
import './HomeCard.css'

function HomeCard() {
  return (
    <div>
      <Box sx={{ height:"2rem" }}>
          <LayeredText/>
          <Heart/>
      </Box>

      {/* ฟอร์มในส่วนของการลงข้อมูล */}
      <Box>
        <Calculator/>
      </Box>

      {/* เนื้อหาเกณฑ์ BMI */}
        <Box
        sx={{
          display: 'block',
          flexDirection:'row',
          // border: '1px dashed grey',
          align: "center",
          background: 'linear-gradient(#dfe2e8  90%)',
          mx: 2,
          mb: 2,
          p: 40,
          pt: 2,
          pb: 2,
          }}
        >

        {/* BMI คืออะไร */}
        
        <div className='header'>BMI คืออะไร</div>
          <div>
            <Card sx={{ p: 2.38, mt: 2 , borderRadius:"2rem" }}>
              ดัชนีมวลกาย หรือ BMI ย่อมาจาก Body Mass Index เป็นค่าสากลที่ใช้เพื่อคำนวณเพื่อหาน้ำหนักตัวที่ควรจะเป็น และประมาณระดับไขมันในร่างกายโดยใช้น้ำหนักตัว และส่วนสูง
              <br/>
              การคำนวณดัชนีมวลกายไม่ใช่การวัดโดยตรงแต่ก็เป็นตัวชี้วัดไขมันในร่างกายที่ค่อนข้างเชื่อถือได้สำหรับคนส่วนใหญ่
              <br/><br/>
              ค่า BMI สามารถใช้บ่งบอกความเสี่ยงในการเกิดโรคต่างๆได้อีกด้วย เช่น โรคเบาหวาน ความดันโลหิตสูง ไขมันในเลือด ระบบหัวใจ รวมไปถึงมะเร็งบางชนิด
              <br/>
              แต่อย่างไรก็ตามค่า BMI เป็นแค่การคำนวณเบื้องต้นเท่านั้น เนื่องจากคุณจำเป็นต้องนำปัจจัยอื่นๆ มาประกอบด้วย 
              <br/><br/>
              ทั้งเรื่องของพันธุกรรม ปริมาณกล้ามเนื้อ พฤติกรรมการกิน 
              การใช้ชีวิต การออกกำลังกาย และอื่นๆ แต่เนื่องจากดัชนีมวลกายมีวิธีคำนวณที่ง่าย 
              <br/>
              จึงทำให้ทุกคนสามารถประเมินความเสี่ยงของตนเอง จากการมีปริมาณไขมันในร่างกายเกินได้
            </Card>
          </div>

          {/* เกณฑ์BMI */}
          <div className='header'>เกณฑ์ BMI</div>
          <Box>
            <Card sx={{ p: 2.38, mt: 2 , borderRadius:"2rem"}}>
              <div className='subheader'>อ้วนเกินไป = มากกว่า 29.9</div>
              <div>ค่อนข้างอันตราย เสี่ยงต่อการเกิดโรคร้ายแรงที่แฝงมากับความอ้วน หากค่า BMI อยู่ในระดับนี้ จะต้องปรับพฤติกรรมการทานอาหาร 
                <br/>และควรเริ่มออกกำลังกาย และหากเลขยิ่งสูงกว่า 40.0 ยิ่งแสดงถึงความอ้วนที่มากขึ้น ควรไปตรวจสุขภาพ และปรึกษาแพทย์</div>
            </Card>

            <Card sx={{ p: 2.38, mt: 3 , borderRadius:"2rem"}}>
              <div className='subheader'>อ้วน = 25.0 - 29.9</div>
              <div>อ้วนในระดับหนึ่ง ถึงแม้จะไม่ถึงเกณฑ์ที่ถือว่าอ้วนมาก ๆ แต่ก็ยังมีความเสี่ยงต่อการเกิดโรคที่มากับความอ้วนได้เช่นกัน ทั้งโรคเบาหวาน 
              <br/>และความดันโลหิตสูง ควรปรับพฤติกรรมการทานอาหาร ออกกำลังกาย และตรวจสุขภาพ</div>
            </Card>
            

            <Card sx={{ p: 2.38, mt: 3 , borderRadius:"2rem"}}>
              <div className='subheader'>น้ำหนักปกติ = 18.6 - 24.9</div>
              <div>น้ำหนักที่เหมาะสมสำหรับคนไทยคือค่า BMI ระหว่าง 18.6-24.9 จัดอยู่ในเกณฑ์ปกติ ห่างไกลโรคที่เกิดจากความอ้วน 
                <br/>และมีความเสี่ยงต่อการเกิดโรคต่าง ๆ น้อยที่สุด ควรพยายามรักษาระดับค่า BMI ให้อยู่ในระดับนี้ให้นานที่สุด และควรตรวจสุขภาพทุกปี</div>
            </Card>

            <Card sx={{ p: 2.38, mt: 3 , borderRadius:"2rem"}}>
              <div className='subheader'>ผอม = น้อยกว่า 18.6 </div>
              <div>น้ำหนักน้อยกว่าปกติก็ไม่ค่อยดี หากคุณสูงมากแต่น้ำหนักน้อยเกินไป อาจเสี่ยงต่อการได้รับสารอาหารไม่เพียงพอหรือได้รับพลังงานไม่เพียงพอ
                <br/>ส่งผลให้ร่างกายอ่อนเพลียง่าย การรับประทานอาหารให้เพียงพอ และการออกกำลังกายเพื่อเสริมสร้างกล้ามเนื้อสามารถช่วยเพิ่มค่า BMI ให้อยู่ในเกณฑ์ปกติได้</div>
            </Card>

          </Box>
      </Box>
    </div>
  )
}

export default HomeCard